Autodesk.Revit.DB.RepeaterBounds.AdjustForCyclicalBounds(Autodesk.Revit.DB.RepeaterCoordinates)
Shifts the input coordinates in the cyclical dimensions so that they fall in the [lower bounds, upper bounds] range.
Remarks:
The coordinates must have the same number of dimensions as the bounds.
This method does not apply to zero dimensional bounds.
coordinates:
The coordinates.
Returns:
The adjusted coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The coordinates coordinates have incompatible number of dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bounds must have at least one dimension.
Since:
2014

Autodesk.Revit.DB.RepeaterBounds.AreCoordinatesInBounds(Autodesk.Revit.DB.RepeaterCoordinates,System.Boolean)
Determines whether given coordinates are within the bounds.
Remarks:
The coordinates must have the same number of dimensions as the bounds.
This method does not apply to zero dimensional bounds.
coordinates:
The coordinates.
treatCyclicalBoundsAsInfinite:
True if cyclical directions should be treated as unbounded.
Returns:
True if the coordinates are within the bounds.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The coordinates coordinates have incompatible number of dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bounds must have at least one dimension.
Since:
2014

Autodesk.Revit.DB.RepeaterBounds.IsCyclical(System.Int32)
True if the array doesn't have finite bounds in the given dimension. Cyclical bounds indicate that the array forms a closed loop in the given dimension.
Remarks:
The dimension begins at 0 and must be in the range [0, number of dimensions in the bounds - 1].
This method does not apply to zero dimensional bounds.
dimension:
The dimension.
Returns:
True if the bounds are cyclical in the given dimension.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The dimension is invalid for these bounds.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bounds must have at least one dimension.
Since:
2014

Autodesk.Revit.DB.RepeaterBounds.GetUpperBound(System.Int32)
Returns the highest index of the array in the given dimension.
Remarks:
The dimension begins at 0 and must be in the range [0, number of dimensions in the bounds - 1].
This method does not apply to zero dimensional bounds.
dimension:
The dimension.
Returns:
The highest index of the array in the given dimension.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The dimension is invalid for these bounds.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bounds must have at least one dimension.
Since:
2014

Autodesk.Revit.DB.RepeaterBounds.GetLowerBound(System.Int32)
Returns the smallest index of the array in the given dimension.
Remarks:
The dimension begins at 0 and must be in the range [0, number of dimensions in the bounds - 1].
This method does not apply to zero dimensional bounds.
dimension:
The dimension.
Returns:
The smallest index of the array in the given dimension.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The dimension is invalid for these bounds.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The bounds must have at least one dimension.
Since:
2014

Autodesk.Revit.DB.RepeaterBounds.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.RepeaterBounds.DimensionCount
The number of dimensions of the bounds (0, 1 or 2 for zero, one or two dimensional arrays.)
Since:
2014

Autodesk.Revit.DB.RepeaterBounds
Represents bounds of the array of repeating references in 0, 1, or 2 dimensions.
(See Autodesk.Revit.DB.RepeatingReferenceSource).
Since:
2014